# TTAD: Práctica 2

## ENRIC LLORCA MENDOZA

In [19]:
import pandas as pd
import numpy as np

 ## 1. Creación de DataFrames

(a) Crea un DataFrame df1 con una columna llamada numeros que contenga los
 valores del 0 al 19

In [23]:
df1 = pd.DataFrame(
    {"numeros":np.arange(20)})

df1

    numeros
0         0
1         1
2         2
3         3
4         4
5         5
6         6
7         7
8         8
9         9
10       10
11       11
12       12
13       13
14       14
15       15
16       16
17       17
18       18
19       19

(b) Crea un DataFrame df2 con una columna aleatorios de tamaño 10 con números aleatorios entre 0 y 1

In [26]:
np.random.seed(1)

df2 = pd.DataFrame(
    {"aleatorios":np.random.random(10)})

df2

   aleatorios
0    0.417022
1    0.720324
2    0.000114
3    0.302333
4    0.146756
5    0.092339
6    0.186260
7    0.345561
8    0.396767
9    0.538817

 (c) Combina los DataFrames anteriores df1 y df2 en un nuevo DataFrame llamado
 df3.

Alternativa 1: Suponiendo que queremos juntar las FILAS de df1 y df2 haremos lo siguiente.

In [29]:
df3 = pd.concat([df1,df2], ignore_index = True)
df3

    numeros  aleatorios
0       0.0         NaN
1       1.0         NaN
2       2.0         NaN
3       3.0         NaN
4       4.0         NaN
5       5.0         NaN
6       6.0         NaN
7       7.0         NaN
8       8.0         NaN
9       9.0         NaN
10     10.0         NaN
11     11.0         NaN
12     12.0         NaN
13     13.0         NaN
14     14.0         NaN
15     15.0         NaN
16     16.0         NaN
17     17.0         NaN
18     18.0         NaN
19     19.0         NaN
20      NaN    0.417022
21      NaN    0.720324
22      NaN    0.000114
23      NaN    0.302333
24      NaN    0.146756
25      NaN    0.092339
26      NaN    0.186260
27      NaN    0.345561
28      NaN    0.396767
29      NaN    0.538817

Alternativa 2: Si hubiesemos querido juntar las COLUMNAS (con los índices coincidentes) lo haríamos de la siguiente manera:

In [55]:
df3 = pd.concat([df1, df2], axis=1)
df3

    numeros  aleatorios
0         0    0.417022
1         1    0.720324
2         2    0.000114
3         3    0.302333
4         4    0.146756
5         5    0.092339
6         6    0.186260
7         7    0.345561
8         8    0.396767
9         9    0.538817
10       10         NaN
11       11         NaN
12       12         NaN
13       13         NaN
14       14         NaN
15       15         NaN
16       16         NaN
17       17         NaN
18       18         NaN
19       19         NaN

 (d) Guarda el DataFrame df3 en un fichero .csv.

In [58]:
df3.to_csv('data/df3_file.csv')

## 2. Indexación y selección (10pts)

In [34]:
import pandas as pd

df =pd.DataFrame({
 "A": range(1, 11),
 "B": [5,3,6,8,2,9,1,7,4,10]
  })
df

    A   B
0   1   5
1   2   3
2   3   6
3   4   8
4   5   2
5   6   9
6   7   1
7   8   7
8   9   4
9  10  10

(a) Seleccionalas filas donde el valor de la columna B sea mayor que 5

In [37]:
df[df["B"]>5]

    A   B
2   3   6
3   4   8
5   6   9
7   8   7
9  10  10

(b) Cambia los valores menores que 4 en la columna B a NaN.
Para usar el valor NaN hay que utilizare el código pd.NA.

In [40]:
df.loc[df["B"]<4,["B"]]=pd.NA #Modifica el df original
df

    A     B
0   1   5.0
1   2   NaN
2   3   6.0
3   4   8.0
4   5   NaN
5   6   9.0
6   7   NaN
7   8   7.0
8   9   4.0
9  10  10.0

## 3.Análisis de Datos

Descargad el conjunto de datos disponible en la siguiente página web y utilizad el fichero winequality-red.csv. 

Este dataset contiene información físico-química sobre diferentes vinos tintos de Portugal.

In [114]:
import pandas as pd

df = pd.read_csv("data/winequality-red.csv", delimiter=";") #Falta establecer ; como separador
df

,fixed acidity,volatile acidity,citric acid,residual sugar,chlorides,free sulfur dioxide,total sulfur dioxide,density,pH,sulphates,alcohol,quality
0,7.4,0.700,0.00,1.9,0.076,11.0,34.0,0.99780,3.51,0.56,9.4,5
1,7.8,0.880,0.00,2.6,0.098,25.0,67.0,0.99680,3.20,0.68,9.8,5
2,7.8,0.760,0.04,2.3,0.092,15.0,54.0,0.99700,3.26,0.65,9.8,5
3,11.2,0.280,0.56,1.9,0.075,17.0,60.0,0.99800,3.16,0.58,9.8,6
4,7.4,0.700,0.00,1.9,0.076,11.0,34.0,0.99780,3.51,0.56,9.4,5
...,...,...,...,...,...,...,...,...,...,...,...,...
1594,6.2,0.600,0.08,2.0,0.090,32.0,44.0,0.99490,3.45,0.58,10.5,5
1595,5.9,0.550,0.10,2.2,0.062,39.0,51.0,0.99512,3.52,0.76,11.2,6
1596,6.3,0.510,0.13,2.3,0.076,29.0,40.0,0.99574,3.42,0.75,11.0,6
1597,5.9,0.645,0.12,2.0,0.075,32.0,44.0,0.99547,3.57,0.71,10.2,5
1598,6.0,0.310,0.47,3.6,0.067,18.0,42.0,0.99549,3.39,0.66,11.0,6

 (a) Obtén los estadísticos descriptivos más relevantes (describe) de cada columna.
 Explica brevemente qué mide cada una de ellas.

In [117]:
df.describe()

,fixed acidity,volatile acidity,citric acid,residual sugar,chlorides,free sulfur dioxide,total sulfur dioxide,density,pH,sulphates,alcohol,quality
count,1599.000000,1599.000000,1599.000000,1599.000000,1599.000000,1599.000000,1599.000000,1599.000000,1599.000000,1599.000000,1599.000000,1599.000000
mean,8.319637,0.527821,0.270976,2.538806,0.087467,15.874922,46.467792,0.996747,3.311113,0.658149,10.422983,5.636023
std,1.741096,0.179060,0.194801,1.409928,0.047065,10.460157,32.895324,0.001887,0.154386,0.169507,1.065668,0.807569
min,4.600000,0.120000,0.000000,0.900000,0.012000,1.000000,6.000000,0.990070,2.740000,0.330000,8.400000,3.000000
25%,7.100000,0.390000,0.090000,1.900000,0.070000,7.000000,22.000000,0.995600,3.210000,0.550000,9.500000,5.000000
50%,7.900000,0.520000,0.260000,2.200000,0.079000,14.000000,38.000000,0.996750,3.310000,0.620000,10.200000,6.000000
75%,9.200000,0.640000,0.420000,2.600000,0.090000,21.000000,62.000000,0.997835,3.400000,0.730000,11.100000,6.000000
max,15.900000,1.580000,1.000000,15.500000,0.611000,72.000000,289.000000,1.003690,4.010000,2.000000,14.900000,8.000000

Tenemos los estadísticos descriptivos de cada columna en forma de filas. Count mide el número de observaciones por columna (número de filas), Mean es la media de los valores (el promedio) y std la desviación estándar. Min y Max miden el máximo y el mínimo valor respectivamente. 

25%, 50%, 75% representan percentiles, es decir, muestran los valores los cuales tienen a su izquierda, es decir, como valores menores el 25, 50 y 75 porciento del resto de valores.

 (b) Convierte la columna quality en una columna categórica con tres categorías:

 • bueno
 
 • regular
 
 • malo

In [121]:
#Hacemos un cut en 3 categorias -> Se dividen los valores de quality en 3 grupos con misma longitud de rango de valores
df["quality"] = pd.cut(df.quality, 3, labels = ["malo", "regular", "bueno"])

#De todas las filas, estas columnas
df.loc[:, ["quality"]].head(10)

   quality
0  regular
1  regular
2  regular
3  regular
4  regular
5  regular
6  regular
7    bueno
8    bueno
9  regular

(c) Selecciona los vinos clasificados como malo y elimínelos del DataFrame.

In [124]:
#1)Seleccionar filas con vinos malos
fila_borrar = df[df["quality"]=="malo"]

#2)Mostrar Indices donde Ocurre
print(fila_borrar.index)

print("-"*10)

#3)Borrar filas donde calidad es mala
df_no_malos = df.drop(fila_borrar.index)

#4)Mostrar Nueva Tabla sin malos vinos
df_no_malos

Index([  18,   38,   41,   45,   73,   79,   94,  151,  161,  167,  170,  199,
        224,  261,  266,  409,  459,  517,  573,  576,  600,  633,  647,  659,
        690,  703,  704,  724,  813,  830,  832,  833,  872,  876,  899,  927,
        937, 1124, 1176, 1189, 1233, 1235, 1238, 1239, 1261, 1263, 1276, 1293,
       1299, 1307, 1363, 1369, 1374, 1423, 1461, 1467, 1469, 1478, 1480, 1482,
       1484, 1505, 1521],
      dtype='int64')
----------

,fixed acidity,volatile acidity,citric acid,residual sugar,chlorides,free sulfur dioxide,total sulfur dioxide,density,pH,sulphates,alcohol,quality
0,7.4,0.700,0.00,1.9,0.076,11.0,34.0,0.99780,3.51,0.56,9.4,regular
1,7.8,0.880,0.00,2.6,0.098,25.0,67.0,0.99680,3.20,0.68,9.8,regular
2,7.8,0.760,0.04,2.3,0.092,15.0,54.0,0.99700,3.26,0.65,9.8,regular
3,11.2,0.280,0.56,1.9,0.075,17.0,60.0,0.99800,3.16,0.58,9.8,regular
4,7.4,0.700,0.00,1.9,0.076,11.0,34.0,0.99780,3.51,0.56,9.4,regular
...,...,...,...,...,...,...,...,...,...,...,...,...
1594,6.2,0.600,0.08,2.0,0.090,32.0,44.0,0.99490,3.45,0.58,10.5,regular
1595,5.9,0.550,0.10,2.2,0.062,39.0,51.0,0.99512,3.52,0.76,11.2,regular
1596,6.3,0.510,0.13,2.3,0.076,29.0,40.0,0.99574,3.42,0.75,11.0,regular
1597,5.9,0.645,0.12,2.0,0.075,32.0,44.0,0.99547,3.57,0.71,10.2,regular
1598,6.0,0.310,0.47,3.6,0.067,18.0,42.0,0.99549,3.39,0.66,11.0,regular

(d) Convierte los valores de la columna "citric acid" a porcentajes.

In [127]:
df["citric acid"]=df["citric acid"]*100

df

,fixed acidity,volatile acidity,citric acid,residual sugar,chlorides,free sulfur dioxide,total sulfur dioxide,density,pH,sulphates,alcohol,quality
0,7.4,0.700,0.0,1.9,0.076,11.0,34.0,0.99780,3.51,0.56,9.4,regular
1,7.8,0.880,0.0,2.6,0.098,25.0,67.0,0.99680,3.20,0.68,9.8,regular
2,7.8,0.760,4.0,2.3,0.092,15.0,54.0,0.99700,3.26,0.65,9.8,regular
3,11.2,0.280,56.0,1.9,0.075,17.0,60.0,0.99800,3.16,0.58,9.8,regular
4,7.4,0.700,0.0,1.9,0.076,11.0,34.0,0.99780,3.51,0.56,9.4,regular
...,...,...,...,...,...,...,...,...,...,...,...,...
1594,6.2,0.600,8.0,2.0,0.090,32.0,44.0,0.99490,3.45,0.58,10.5,regular
1595,5.9,0.550,10.0,2.2,0.062,39.0,51.0,0.99512,3.52,0.76,11.2,regular
1596,6.3,0.510,13.0,2.3,0.076,29.0,40.0,0.99574,3.42,0.75,11.0,regular
1597,5.9,0.645,12.0,2.0,0.075,32.0,44.0,0.99547,3.57,0.71,10.2,regular
1598,6.0,0.310,47.0,3.6,0.067,18.0,42.0,0.99549,3.39,0.66,11.0,regular

(e) Obtén los siete vinos con mayor valor de pH.

In [130]:
#Ordenar por pH de forma descendente y tomar los 7 primeros vinos
df_vinos = df.sort_values(by = "pH", ascending = False).head(7)
df_vinos

,fixed acidity,volatile acidity,citric acid,residual sugar,chlorides,free sulfur dioxide,total sulfur dioxide,density,pH,sulphates,alcohol,quality
1316,5.4,0.740,0.0,1.20,0.041,16.0,46.0,0.99258,4.01,0.59,12.5,regular
1321,5.0,0.740,0.0,1.20,0.041,16.0,46.0,0.99258,4.01,0.59,12.5,regular
695,5.1,0.470,2.0,1.30,0.034,18.0,44.0,0.99210,3.90,0.62,12.8,regular
45,4.6,0.520,15.0,2.10,0.054,8.0,65.0,0.99340,3.90,0.56,13.1,malo
95,4.7,0.600,17.0,2.30,0.058,17.0,106.0,0.99320,3.85,0.60,12.9,regular
1300,5.2,0.645,0.0,2.15,0.080,15.0,28.0,0.99444,3.78,0.61,12.5,regular
1111,5.4,0.420,27.0,2.00,0.092,23.0,55.0,0.99471,3.78,0.64,12.3,bueno

Los vinos con estos índices son los que tienen mayor pH:

In [50]:
df_vinos.index

Index([1316, 1321, 695, 45, 95, 1300, 1111], dtype='int64')

## Parte II

Ahora crea un fichero.py que defina las siguientes funciones:

(a) eliminaDecimales(df, col): recibe un DataFrame y el nombre de una columna, y crea una nueva columna llamada <col> sin decimales con el mismo valor pero truncado (sin decimales).

Aplica la primera función a la columna alcohol

In [56]:
#Recuperamos el fichero original para facilitar el trabajo

import pandas as pd

df = pd.read_csv("data/winequality-red.csv", delimiter=";") #Falta establecer ; como separador
df

,fixed acidity,volatile acidity,citric acid,residual sugar,chlorides,free sulfur dioxide,total sulfur dioxide,density,pH,sulphates,alcohol,quality
0,7.4,0.700,0.00,1.9,0.076,11.0,34.0,0.99780,3.51,0.56,9.4,5
1,7.8,0.880,0.00,2.6,0.098,25.0,67.0,0.99680,3.20,0.68,9.8,5
2,7.8,0.760,0.04,2.3,0.092,15.0,54.0,0.99700,3.26,0.65,9.8,5
3,11.2,0.280,0.56,1.9,0.075,17.0,60.0,0.99800,3.16,0.58,9.8,6
4,7.4,0.700,0.00,1.9,0.076,11.0,34.0,0.99780,3.51,0.56,9.4,5
...,...,...,...,...,...,...,...,...,...,...,...,...
1594,6.2,0.600,0.08,2.0,0.090,32.0,44.0,0.99490,3.45,0.58,10.5,5
1595,5.9,0.550,0.10,2.2,0.062,39.0,51.0,0.99512,3.52,0.76,11.2,6
1596,6.3,0.510,0.13,2.3,0.076,29.0,40.0,0.99574,3.42,0.75,11.0,6
1597,5.9,0.645,0.12,2.0,0.075,32.0,44.0,0.99547,3.57,0.71,10.2,5
1598,6.0,0.310,0.47,3.6,0.067,18.0,42.0,0.99549,3.39,0.66,11.0,6

In [136]:
import numpy as np #Invocar np para cambiar de float a enteros
import p2_funciones as p2 #Invocar fichero .py

#Aplicamos la función del fichero sobre la columna
p2.eliminaDecimales(df, "alcohol")

,fixed acidity,volatile acidity,citric acid,residual sugar,chlorides,free sulfur dioxide,total sulfur dioxide,density,pH,sulphates,alcohol,quality,Sin decimales
0,7.4,0.700,0.0,1.9,0.076,11.0,34.0,0.99780,3.51,0.56,9.4,regular,9
1,7.8,0.880,0.0,2.6,0.098,25.0,67.0,0.99680,3.20,0.68,9.8,regular,9
2,7.8,0.760,4.0,2.3,0.092,15.0,54.0,0.99700,3.26,0.65,9.8,regular,9
3,11.2,0.280,56.0,1.9,0.075,17.0,60.0,0.99800,3.16,0.58,9.8,regular,9
4,7.4,0.700,0.0,1.9,0.076,11.0,34.0,0.99780,3.51,0.56,9.4,regular,9
...,...,...,...,...,...,...,...,...,...,...,...,...,...
1594,6.2,0.600,8.0,2.0,0.090,32.0,44.0,0.99490,3.45,0.58,10.5,regular,10
1595,5.9,0.550,10.0,2.2,0.062,39.0,51.0,0.99512,3.52,0.76,11.2,regular,11
1596,6.3,0.510,13.0,2.3,0.076,29.0,40.0,0.99574,3.42,0.75,11.0,regular,11
1597,5.9,0.645,12.0,2.0,0.075,32.0,44.0,0.99547,3.57,0.71,10.2,regular,10
1598,6.0,0.310,47.0,3.6,0.067,18.0,42.0,0.99549,3.39,0.66,11.0,regular,11

(b) calculaRatio(df, col1, col2): calcula el ratio entre dos columnas y genera una excepción si algún valor del ratio es mayor que 1

Aplica la segunda función a las columnas "total sulfur dioxide" y "free sulfur dioxide".

In [140]:
# CASO1: Devolver error especifico si algun valor del ratio es mayor que 1
p2.calculaRatio(df, "total sulfur dioxide", "free sulfur dioxide")

ValueError: Algún valor del ratio es mayor que 1.

In [142]:
# CASO2: Si lo probamos a la inversa... todos los ratio menores a 1
p2.calculaRatio(df, "free sulfur dioxide", "total sulfur dioxide")

,fixed acidity,volatile acidity,citric acid,residual sugar,chlorides,free sulfur dioxide,total sulfur dioxide,density,pH,sulphates,alcohol,quality,ratio
0,7.4,0.700,0.0,1.9,0.076,11.0,34.0,0.99780,3.51,0.56,9.4,regular,0.323529
1,7.8,0.880,0.0,2.6,0.098,25.0,67.0,0.99680,3.20,0.68,9.8,regular,0.373134
2,7.8,0.760,4.0,2.3,0.092,15.0,54.0,0.99700,3.26,0.65,9.8,regular,0.277778
3,11.2,0.280,56.0,1.9,0.075,17.0,60.0,0.99800,3.16,0.58,9.8,regular,0.283333
4,7.4,0.700,0.0,1.9,0.076,11.0,34.0,0.99780,3.51,0.56,9.4,regular,0.323529
...,...,...,...,...,...,...,...,...,...,...,...,...,...
1594,6.2,0.600,8.0,2.0,0.090,32.0,44.0,0.99490,3.45,0.58,10.5,regular,0.727273
1595,5.9,0.550,10.0,2.2,0.062,39.0,51.0,0.99512,3.52,0.76,11.2,regular,0.764706
1596,6.3,0.510,13.0,2.3,0.076,29.0,40.0,0.99574,3.42,0.75,11.0,regular,0.725000
1597,5.9,0.645,12.0,2.0,0.075,32.0,44.0,0.99547,3.57,0.71,10.2,regular,0.727273
1598,6.0,0.310,47.0,3.6,0.067,18.0,42.0,0.99549,3.39,0.66,11.0,regular,0.428571

## 4.Combinando información en pandas

Dispones de los siguientes DataFrames:

In [145]:
import pandas as pd

estudiantes= pd.DataFrame({
    "id":[1, 2, 3,4],
    "nombre":["Ana", "Luis","Marta", "Jorge"]
 })

notas =pd.DataFrame({
    "id":[1, 2, 2,5],
    "asignatura":["Matemáticas","Historia","Química","Biología"],
    "nota":[8.5, 7.0,6.5, 9.0]
 })

In [71]:
estudiantes

   id nombre
0   1    Ana
1   2   Luis
2   3  Marta
3   4  Jorge

In [73]:
notas

   id   asignatura  nota
0   1  Matemáticas   8.5
1   2     Historia   7.0
2   2      Química   6.5
3   5     Biología   9.0

(a) Realiza un merge interno (inner) entre ambos DataFrames. ¿Cuántas filas se obtienen? ¿Por qué?

In [147]:
estudiantes.merge(notas, left_on='id', right_on='id', how='inner')

   id nombre   asignatura  nota
0   1    Ana  Matemáticas   8.5
1   2   Luis     Historia   7.0
2   2   Luis      Química   6.5

Observamos que solamente se obtienen 3 filas. Esto se debe a que solamente hay 3 filas donde coincida la variable id. En el caso de estudiantes tenemos 2 individuos con id 1 y 2 y en notas 2 con observaciones con id 2 y una con id 1. Las id 1 y 2 son las únicas que coinciden. id 3 y 4 no se encuentran en notas y id 5 no se halla en estudiantes.

(b) Realiza un merge externo (outer). Explica las filas que aparecen con valores nulos.

In [151]:
estudiantes.merge(notas, left_on='id', right_on='id', how='outer')

   id nombre   asignatura  nota
0   1    Ana  Matemáticas   8.5
1   2   Luis     Historia   7.0
2   2   Luis      Química   6.5
3   3  Marta          NaN   NaN
4   4  Jorge          NaN   NaN
5   5    NaN     Biología   9.0

Dado que, como hemos explicado en el apartado anterior, hay datos de id que no están en uno u otro fichero, los datos para esos ficheros que no encuentran un "match" en las columnas del otro DataFrame quedan como valores desconocidos NaN cuando hacemos un Outer Merge, que muestra todos los datos de los dos conjuntos, hagan o no "match" el uno con el otro.

(c) Realiza un left merge usando estudiantes como tabla izquierda. ¿Qué información se pierde respecto al outer?

In [84]:
estudiantes.merge(notas, left_on='id', right_on='id', how='left')

   id nombre   asignatura  nota
0   1    Ana  Matemáticas   8.5
1   2   Luis     Historia   7.0
2   2   Luis      Química   6.5
3   3  Marta          NaN   NaN
4   4  Jorge          NaN   NaN

El Left Merge coge como DataFrame base estudiantes (izquierda) y a este le añade las columnas del DataFrame notas (derecha) que hagan "match", por lo que, como el id 5 no aparece en estudiantes, se pierde la última fila del Outer Merge

(d) Realiza un right merge usando notas como tabla derecha. ¿Qué estudiantes desaparecen en el resultado?

In [88]:
estudiantes.merge(notas, left_on='id', right_on='id', how='right')

   id nombre   asignatura  nota
0   1    Ana  Matemáticas   8.5
1   2   Luis     Historia   7.0
2   2   Luis      Química   6.5
3   5    NaN     Biología   9.0

Ahora es al contrario, el Right Merge, hace que tan solo se complete la información para los id que ya tenemos de la tabla derecha, notas, por lo que en este caso se pieden los datos cuyos id eran 3 y 4. En definitiva, se pierden los datos del id y nombres de Marta y Jorge (2 filas).

(e) Añade una columna llamada curso al DataFrame estudiantes. Después, combina los datos utilizando un merge mútiple por id y explica el resultado.

In [92]:
#1) Vamos a añadir la nueva columna con datos inventados

estudiantes2 = estudiantes.assign(curso=[4,5,6,2])
estudiantes2 #DataFrame Modificado

   id nombre  curso
0   1    Ana      4
1   2   Luis      5
2   3  Marta      6
3   4  Jorge      2

In [94]:
#2) Merge Múltiple por id y explicar resultados: inner merge es el merge por defecto
estudiantes2.merge(notas, left_on='id', right_on='id')

   id nombre  curso   asignatura  nota
0   1    Ana      4  Matemáticas   8.5
1   2   Luis      5     Historia   7.0
2   2   Luis      5      Química   6.5

De nuevo, los resultados del 'inner' merge resultan en 3 filas ya que tan solo los id 1 y 2 coinciden en ambos DataFrames, con 2 personas con dos datos para la persona con id 2 (Luis) en el DataFrame notas. 

Debido esto, al hacer un 'inner' merge o join, perdemos la información sobre el curso de Marta y Jorge (cursos 6 y 2) al no haber datos en el DataFrame notas que hagan match con sus id (3 y 4).

## 5.Agregaciones y operaciones con groupby

En este ejercicio se trabajará con un conjunto de datos que contiene información sobre ventas realizadas por una empresa en distintas regiones. Considera el siguiente DataFrame:

In [198]:
import pandas as pd

ventas= pd.DataFrame({
    "region":["Norte","Norte","Sur","Este","Sur","Este","Oeste","Oeste","Norte","Sur"],
    "vendedor":["Ana","Luis","Ana","Jorge","Luis","Ana","Marta","Luis","Ana","Jorge"],
    "ventas":[1200, 800,950, 1100,400, 1600,700, 450,895, 900],
    "producto":["A","A","B","A","B","A","B","A","B","B"]
})
ventas

  region vendedor  ventas producto
0  Norte      Ana    1200        A
1  Norte     Luis     800        A
2    Sur      Ana     950        B
3   Este    Jorge    1100        A
4    Sur     Luis     400        B
5   Este      Ana    1600        A
6  Oeste    Marta     700        B
7  Oeste     Luis     450        A
8  Norte      Ana     895        B
9    Sur    Jorge     900        B

Realiza las siguientes tareas:
 (a) Obtén el total de ventas por región.

In [201]:
#Agrupamos por region y calculamos la suma de ventas 
gr = ventas.groupby(['region'])["ventas"].sum()
gr

region
Este     2700
Norte    2895
Oeste    1150
Sur      2250
Name: ventas, dtype: int64

 (b) Calcula la media, el valor máximo y el mínimo de las ventas agrupadas por vendedor.

In [204]:
#Agrupamos por vendedor y mostramos la medio, el máximo y mínimo de las ventas
gr = ventas.groupby("vendedor")["ventas"].agg(["mean", "max", "min"])
gr

             mean   max  min
vendedor
Ana       1161.25  1600  895
Jorge     1000.00  1100  900
Luis       550.00   800  400
Marta      700.00   700  700

 (c) Calcula el número de ventas realizadas por cada combinación de region y producto.

Nota: Si interpretamos que "ventas" es el número de ventas que se realizan de cada producto por cada vendedor habría que usar sum()

In [208]:
#Agrupamos por region, luego producto y damos el total de ventas
gr = ventas.groupby(["region", "producto"])["ventas"].sum()
gr

region  producto
Este    A           2700
Norte   A           2000
        B            895
Oeste   A            450
        B            700
Sur     B           2250
Name: ventas, dtype: int64

Pero, si interpretamos que "ventas" es el importe de cada venta, debemos usar count() para obtener el número de ventas realizadas

In [211]:
#Agrupamos por region, luego producto y damos el total de ventas
gr = ventas.groupby(["region", "producto"])["ventas"].count()
gr

region  producto
Este    A           2
Norte   A           2
        B           1
Oeste   A           1
        B           1
Sur     B           3
Name: ventas, dtype: int64

 (d) Crea una función llamada rango_ventas en un fichero.py que calcule la diferencia entre el valor máximo y mínimo de un grupo. Aplícala a las ventas agrupando por región.

In [186]:
#Llamar fichero .py
import p2_funciones as p2

#Aplicar la función sobre las ventas, que están agrupadas por región.
rango_por_region = ventas.groupby("region")["ventas"].apply(p2.rango_ventas)
rango_por_region

region
Este     500
Norte    400
Oeste    250
Sur      550
Name: ventas, dtype: int64

 (e) Identifica la región con el mayor número total de ventas y muestra solo esa región.

In [116]:
#(1) Agrupar por región con el total de ventas
gr = ventas.groupby("region")["ventas"].sum()
print(gr)

print("-"*10)

#(2) Ordenar de más a menos ventas
gr_sorted = gr.sort_values(ascending= False)
print(gr_sorted)

#(3) Hallar el maximo
gr.max()

print("-"*10)

#(4) Mostrar solo esa región
print(gr[gr==gr.max()])

print("-"*10)

#(5) Región donde máximo (nombre de la región)
print("Región con Máximo número de ventas: ", gr_sorted.index[0])

#Alternativa...

print("Región con Máximo número de ventas: ", gr[gr==gr.max()].index[0])

region
Este     2700
Norte    2895
Oeste    1150
Sur      2250
Name: ventas, dtype: int64
----------
region
Norte    2895
Este     2700
Sur      2250
Oeste    1150
Name: ventas, dtype: int64
----------
region
Norte    2895
Name: ventas, dtype: int64
----------
Región con Máximo número de ventas:  Norte
Región con Máximo número de ventas:  Norte

# 6.Gestión de Datos Ausentes

Utilizando los mismos datos que en el ejercicio cuatro realiza un merge por la izquierda, siendo el primer elemento el DataFrame con la información de estudiantes y el segundo elemento el DataFrame de notas.

In [19]:
#1) Recuperamos los datos del ejercicio 4

import pandas as pd

estudiantes= pd.DataFrame({
    "id":[1, 2, 3,4],
    "nombre":["Ana", "Luis","Marta", "Jorge"]
 })

notas =pd.DataFrame({
    "id":[1, 2, 2,5],
    "asignatura":["Matemáticas","Historia","Química","Biología"],
    "nota":[8.5, 7.0,6.5, 9.0]
 })


#2) Merge por la izquierda
df_nuevo = estudiantes.merge(notas, left_on='id', right_on='id', how='left')
df_nuevo

   id nombre   asignatura  nota
0   1    Ana  Matemáticas   8.5
1   2   Luis     Historia   7.0
2   2   Luis      Química   6.5
3   3  Marta          NaN   NaN
4   4  Jorge          NaN   NaN

(a) Cuenta cuantos NaNs aparecen en cada columna

In [23]:
#Buscar NAs -> Nos devuelve un Conteo por Columna

df_nuevo.isna().sum()

id            0
nombre        0
asignatura    2
nota          2
dtype: int64